Revit 2027 API
AirSystemData.PreheatCoilType Property
 The preheat coil type. Note this property change would reset the preheat water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AirHeatingCoilType PreheatCoilType { get; set; }
Public Property PreheatCoilType As AirHeatingCoilType
	Get
	Set
public:
property AirHeatingCoilType PreheatCoilType {
	AirHeatingCoilType get ();
	void set (AirHeatingCoilType value);
}
member PreheatCoilType : AirHeatingCoilType with get, set
Property Value
AirHeatingCoilType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
AirSystemData Class
Autodesk.Revit.DB.Mechanical Namespace